Core/src/src/Documents/ПеремещениеВА/ПеремещениеВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеВА</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>InformationRegister.СостоянияВнеоборотныхАктивов</registerRecords>
  <registerRecords>InformationRegister.УчетПоПроектамВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDTТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусТН</name>
    <type>
      <types>EnumRef.РС_СтатусыТН</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиницаПолучатель</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПолучатель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизациюВТекущемМесяце</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектПолучатель</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственноеЛицо</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РыночнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийПеремещенияВА</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/InformationRegisters/ПараметрыВнеоборотныхАктивов/ПараметрыВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыВнеоборотныхАктивов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименитьВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <comment>Срок использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПеремещенияВА</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/РыночныеЦеныВА/РыночныеЦеныВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РыночныеЦеныВА</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Имущество</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Enums/СостоянияВнеоборотныхАктивов/СостоянияВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВнеоборотныхАктивов</name>
  <enumValues>
    <name>ПринятКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятСУчета</name>
  </enumValues>
  <enumValues>
    <name>НеПринятКУчету</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/ВнеоборотныеАктивы/ВнеоборотныеАктивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнеоборотныеАктивы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизации</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизацииРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнеоборотныеАктивы</name>
    <type>
      <types>CatalogRef.ТипОсновныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяСтоимостьДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадастровыйКод</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>CatalogRef.КадастровыеКоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНалогаИмущества</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПокупки</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyОтветственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpАмортизационнаяГруппа</name>
    <type>
      <types>CatalogRef.AzRytmpОПТИМУС_АмортизационныеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/Documents/ПеремещениеВА/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Паганини_
	НайденныйЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(Объект.Ссылка);
	Элементы.ЭлектроннаяНакладнаяНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьЭлНакладная(НайденныйЭлНакладная);
	Элементы.ЭлектроннаяНакладнаяНадпись.Доступность= РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп.ПодсистемаДоступна_ИнтеграцияСНалоговойСлужбойГрузии();
	//_Паганини
	
	//+++ Дмгг
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
		
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()); //+++ Дмгг
	Иначе
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ДатаДокумента);
	КонецЕсли;
	//--- Дмгг
	
	//ПодольскийАИ #УчетПроектов 08.12.2020 {
	УчетПоПроектам = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	//ПодольскийАИ #УчетПроектов 08.12.2020 }
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры

&НаСервере
Процедура ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(УИДСтроки)
	
	ДатаЗапроса = Дата(1,1,1);
	Если ЗначениеЗаполнено(Объект.Дата) Тогда 
		Если Объект.Дата = НачалоДня(Объект.Дата) Тогда 
			ДатаЗапроса = ТекущаяДата();
		Иначе
			ДатаЗапроса = Объект.Дата-1;
		КонецЕсли;
	Иначе
		ДатаЗапроса = ТекущаяДата();
	КонецЕсли;
	
	СтрокаЗаполнения = Объект.ВнеоборотныеАктивы.НайтиПоИдентификатору(УИДСтроки);
	
	Если СтрокаЗаполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктивТек,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПолучатель,
	|	ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатрат КАК СчетЗатрат,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ПараметрыАмортизацииСрезПоследних.Адрес КАК Адрес,
	|	ПараметрыАмортизацииСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПараметрыАмортизацииСрезПоследних.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ПараметрыАмортизацииСрезПоследних.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка,
	//Paganini_
	|	ЕСТЬNULL(СостоянияВнеоборотныхАктивовСрезПоследних.НачислятьАмортизацию, ЛОЖЬ) КАК Амортизация,
	|	ЕСТЬNULL(СостоянияВнеоборотныхАктивовСрезПоследних.НачислятьАмортизациюВТекущемМесяце, ЛОЖЬ) КАК НачислятьАмортизациюВТекущемМесяце,
	//_Paganini
	|	ЕСТЬNULL(РыночныеЦеныВАСрезПоследних.Цена, 0) КАК РыночнаяЦена
	|ИЗ
	|	РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(
	|			&ДатаДокумента,
	|			Организация = &Организация
	|				И ВнеоборотныйАктив = &ВнеоборотныйАктив
	//Paganini_
	|				И НЕ Регистратор = &Ссылка
	//_Paganini
	|) КАК ПараметрыАмортизацииСрезПоследних
	//Paganini_
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(
	|				&ДатаДокумента,
	|				Организация = &Организация
	|					И ВнеоборотныйАктив = &ВнеоборотныйАктив
	|					И НЕ Регистратор = &Ссылка) КАК СостоянияВнеоборотныхАктивовСрезПоследних
	|		ПО ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив = СостоянияВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
	//_Paganini
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РыночныеЦеныВА.СрезПоследних(&ДатаДокумента, ) КАК РыночныеЦеныВАСрезПоследних
	|		ПО ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив = РыночныеЦеныВАСрезПоследних.Имущество";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаЗапроса);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", СтрокаЗаполнения.ВнеоборотныйАктив);
	//Paganini_
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//_Paganini
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультат.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(СтрокаЗаполнения ,ВыборкаРезультат);
	КонецЦикла;
	
	//ПодольскийАИ #УчетПроектов 08.12.2020 {
	СтрокаЗаполнения.Проект = Справочники.Проекты.ПустаяСсылка();
	СтрокаЗаполнения.ПроектПолучатель = Справочники.Проекты.ПустаяСсылка();
	Если УчетПоПроектам Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив,
		|	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.Проект
		|ИЗ
		|	РегистрСведений.УчетПоПроектамВнеоборотныхАктивов.СрезПоследних(
		|			&ДатаДокумента,
		|			Организация = &Организация
		|				И ВнеоборотныйАктив = &ВнеоборотныйАктив) КАК УчетПоПроектамВнеоборотныхАктивовСрезПоследних";
		
		ВыборкаРезультат = Запрос.Выполнить().Выбрать();
		Пока ВыборкаРезультат.Следующий() Цикл 
			СтрокаЗаполнения.Проект = ВыборкаРезультат.Проект;
			СтрокаЗаполнения.ПроектПолучатель = ВыборкаРезультат.Проект;
		КонецЦикла;
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 08.12.2020 }
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыВнеоборотныйАктивПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	ТекСтрока.СтруктурнаяЕдиница = НайтиСкладВПринятиеКУчету(ТекСтрока.ВнеоборотныйАктив);
	
	УИДСтроки = ТекСтрока.ПолучитьИдентификатор();
	
	ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(УИДСтроки);
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаСервере
Функция НайтиСкладВПринятиеКУчету(ВнеоборотныйАктив)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПринятиеКУчетуВА.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ИЗ
		|	Документ.ПринятиеКУчетуВА КАК ПринятиеКУчетуВА
		|ГДЕ
		|	ПринятиеКУчетуВА.ВнеоборотныеАктивы.ВнеоборотныйАктив = &ВнеоборотныйАктив";
	
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", ВнеоборотныйАктив);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
	КонецЦикла;
	
	Возврат Неопределено;	
КонецФункции

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры


//Паганини_
&НаКлиенте
Процедура ЭлектроннаяНакладнаяНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьВозможностьСозданияЭЛНакладной() Тогда 
		Возврат;	
	КонецЕсли;
	
	
	ПараметрыФормы   = Новый Структура;
	массивДокументов = Новый Массив;
	массивДокументов.Добавить(Объект.Ссылка);
	ПараметрыФормы.Вставить("ДокументыОснования", массивДокументов);
	
	УправлениеНебольшойФирмойКлиент.ОткрытьЭлНакладную(ЭтотОбъект,ПараметрыФормы);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
КонецПроцедуры
&НаКлиенте
Функция ПроверитьВозможностьСозданияЭЛНакладной()
	
	Результат = Истина;
	Если Модифицированность Или НЕ ПроверитьЗаполнение() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='დოკუმენტი შეიცვალა. თავდაპირველად, საჭიროა დოკუმენტის ჩაწერა!';ru='Документ был изменен. Сначала следует записать документ!';en='The document has been changed. First, you must write the document!'");	
		Сообщение.Сообщить();
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции


&НаСервере
Процедура ВнеоборотныеАктивыСтруктурнаяЕдиницаПолучательПриИзмененииНаСервере(УИД_Строки)
	
	ТекСтрока = Объект.ВнеоборотныеАктивы.НайтиПоИдентификатору(УИД_Строки);
	
	МассивАдресовСтруктурнойЕдиницы = ТекСтрока.СтруктурнаяЕдиницаПолучатель.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы));
	
	Если МассивАдресовСтруктурнойЕдиницы.Количество() <> 0 Тогда 
		ТекСтрока.АдресПолучатель = МассивАдресовСтруктурнойЕдиницы[0].Представление;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВнеоборотныеАктивыСтруктурнаяЕдиницаПолучательПриИзменении(Элемент)
	ТекСтрока= Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	УИД_Строки = ТекСтрока.ПолучитьИдентификатор();
	ВнеоборотныеАктивыСтруктурнаяЕдиницаПолучательПриИзмененииНаСервере(УИД_Строки);
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент) //+++ Дмгг
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Объект.Дата); //+++ Дмгг
	
КонецПроцедуры
//_Паганини

//+++ Дмгг
&НаКлиенте
Функция ПолучитьДанныеВыбораПоАдресу(Элемент, Адрес, СтандартнаяОбработка)

    // Выключим стандартную обработку
    СтандартнаяОбработка    =    Ложь;
    
    // Определим структуру для получения параметров отбора, 
    // так как стандартный выбор мы выключим значения структуры пусты                                                            
    ПараметрыПодбора    =    Новый Структура("Отбор,СтрокаПоиска,ВыборГруппИЭлементов",
                                Новый Структура(), // Здесь можно установить отбор
                                "",                // Передаем введенный в поле текст
                                ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
                                
    // Дополним стандартную структуру с дополнительными параметрами для поиска по адресу
    ПараметрыПодбора.Вставить("ДополнительныеПараметры", Новый Структура("Адрес", Адрес));
    
    
    // Передаем адрес и получаем список выбора
    Возврат    ПолучитьДанныеВыбора(Тип("СправочникСсылка.Адреса"), ПараметрыПодбора);

КонецФункции

&НаКлиенте
Процедура ВнеоборотныеАктивыАдрессПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	
	П = Новый Структура;
    П.Вставить("Ключ", ТекСтрока.АдресПолучатель);

   ОткрытьФорму("Справочник.Адреса.ФормаВыбора", П, ЭтаФорма,,,,Новый ОписаниеОповещения("РедактироватьАдресаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьАдресаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	Если ЗначениеЗаполнено(Результат) Тогда 
		ТекСтрока.АдресПолучатель = Результат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыАдрессПолучательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	
	ТекСтрока.АдресПолучатель    =    ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыАдрессПолучательАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;

    знТекст    =    ?(ПустаяСтрока(Текст), ТекСтрока.АдресПолучатель, Текст);
    ДанныеВыбора    =    ПолучитьДанныеВыбораПоАдресу(Элемент, знТекст, СтандартнаяОбработка);
	
КонецПроцедуры

//--- Дмгг


//Rajak
&НаКлиенте
Процедура ВнеоборотныеАктивыВнеоборотныйАктивНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", СписокКонтрагентов());
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элемент.ПараметрыВыбора = НовыеПараметры;

КонецПроцедуры


&НаСервере
Функция СписокКонтрагентов()
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнеоборотныеАктивы.Ссылка КАК Ссылка,
		|	СостоянияВнеоборотныхАктивовСрезПоследних.Организация КАК Организация,
		|	СостоянияВнеоборотныхАктивовСрезПоследних.НачислятьАмортизацию КАК НачислятьАмортизацию,
		|	СостоянияВнеоборотныхАктивовСрезПоследних.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
		|	СостоянияВнеоборотныхАктивовСрезПоследних.Состояние КАК Состояние
		|ИЗ
		|	Справочник.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&ДатаОтбора, ) КАК СостоянияВнеоборотныхАктивовСрезПоследних
		|		ПО ВнеоборотныеАктивы.Ссылка = СостоянияВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
		|ГДЕ
		|	НЕ ВнеоборотныеАктивы.ПометкаУдаления
		|	И НЕ СостоянияВнеоборотныхАктивовСрезПоследних.Состояние ЕСТЬ NULL
		|	И НЕ ВнеоборотныеАктивы.ЭтоГруппа
		|	И СостоянияВнеоборотныхАктивовСрезПоследних.Состояние = &Состояние";
	
	Запрос.УстановитьПараметр("ДатаОтбора", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияВнеоборотныхАктивов.ПринятКУчету);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    
КонецФункции

&НаКлиенте
Процедура ВнеоборотныеАктивыПриИзменении(Элемент)
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыПослеУдаления(Элемент)
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыРиночнаяЦенаПриИзменении(Элемент)
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвалФормы()
	
	ИтогОбщаяСтоимость = Объект.ВнеоборотныеАктивы.Итог("РыночнаяЦена");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
КонецПроцедуры

//Rajak
